//Задание 1 
let now = new Date()
console.log(now);
//Задание 1 другим способом
console.log(new Date())
//Задание 2 
var i= 0;
while (i<5) {
i +=1;
console.log("С Новым Годом");    
}
// Новый год не напечатался 5 раз,но рядом с ним появилась цифра 5,значит это правильно?

//Задание 3
var people = ['Олег','Сергей', 'Никита', 'Руслан','Дарья','Ульяна','Давид'];
var i = 0;
while (i < people.length) {
    console.log(people[i++]);// Забыл сначала написать i++ и чуть не сломал браузер
}

//Задание 4
var people = ['Олег','Сергей', 'Никита', 'Руслан','Дарья','Ульяна','Давид'];
var i = 0;
while (i < people.length) {
    console.log(people[i++],"Привет ,Вера!");
}
//  Немного не понял, правильно ли я понял задание 
//Задание 5 
 function press() {
var arr = [1, 2, 3, 4, 5, 6];
console.log(arr)
}

//Задание 6




